Tekla Open API Reference for Tekla Structures 2025
SecondaryTypeAttribute Class
 The SecondaryTypeAttribute class is used for storing the number of needed secondaries in the connection. Based on the type the system can then correctly ask for user input in the creation. The attribute is initialized from the custom attribute i.e. [SecondaryType(ConnectionBase.SecondaryType.SECONDARYTYPE_ONE)] in the connection source.
Inheritance Hierarchy
System.Object
 System.Attribute
 Tekla.Structures.Plugins.SecondaryTypeAttribute
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class SecondaryTypeAttribute : Attribute
Public NotInheritable Class SecondaryTypeAttribute
	Inherits Attribute
The SecondaryTypeAttribute type exposes the following members.
Constructors
Name | Description
SecondaryTypeAttribute(Int32)
 The custom attribute [SecondaryType()] uses this to store the secondary type to the system. This is not to be used by itself.
SecondaryTypeAttribute(ConnectionBase.SecondaryType)
 The custom attribute [SecondaryType()] uses this to store the secondary type to the system. This is not to be used by itself.
Top
Properties
Name | Description
Type
 The custom attribute [SecondaryType()] uses this to store the secondary type to the system. This is not to be used by itself.
Top
See Also
Reference
Tekla.Structures.Plugins Namespace